ranjithaguna/pv/LED_Demo/source/pic32cx/component/kbc.h
/**
 * \brief Component description for PIC32CX/0525SG12 KBC
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_KBC_COMPONENT_H_
#define _PIC32CX_0525SG12_KBC_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_KBC The keyboard controller uses the EC to produce a superset of the features provided by the\n        industry-standard 8042 keyboard controller. The 8042 Emulated Keyboard Controller is a Host/EC\n     Message Interface with hardware assists to emulate 8042 behavior and provide Legacy GATEA20 support.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR KBC */
/* ========================================================================== */

/* -------- KBC_EC_HOST_DATA_AUX_DATA : (KBC Offset: 0x00) (R/ 8) READ_DATA. This 8-bit register is read-only. When read by the Host, the PCOBF and/or AUXOBF interrupts are cleared and the\n     OBF flag in the status register is cleared. -------- */

typedef union
{
  uint8_t  w;
} __KBC_EC_HOST_DATA_AUX_DATA_bits_t;
#define KBC_EC_HOST_DATA_AUX_DATA_RESETVALUE (0x00U)                                       /**<  (KBC_EC_HOST_DATA_AUX_DATA) READ_DATA. This 8-bit register is read-only. When read by the Host, the PCOBF and/or AUXOBF interrupts are cleared and the\n     OBF flag in the status register is cleared.  Reset Value */

#define KBC_EC_HOST_DATA_AUX_DATA_Msk         (0x00000000UL)                                 /**< (KBC_EC_HOST_DATA_AUX_DATA) Register Mask  */

/* -------- KBC_HOST_EC_DATA : (KBC Offset: 0x00) (/W 8) WRITE_DATA. This 8-bit register is write-only. When written, the C/D bit in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host,\n     it functions as the EC_HOST Data / AUX Data Register. -------- */

typedef union
{
  uint8_t  w;
} __KBC_HOST_EC_DATA_bits_t;
#define KBC_HOST_EC_DATA_RESETVALUE         (0x00U)                                       /**<  (KBC_HOST_EC_DATA) WRITE_DATA. This 8-bit register is write-only. When written, the C/D bit in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host,\n     it functions as the EC_HOST Data / AUX Data Register.  Reset Value */

#define KBC_HOST_EC_DATA_Msk                  (0x00000000UL)                                 /**< (KBC_HOST_EC_DATA) Register Mask  */

/* -------- KBC_HOST_EC_CMD : (KBC Offset: 0x04) (/W 8) WRITE_CMD. This 8-bit register is write-only and is an alias of the register at offset 0h. When written, the C/D bit in the\n     Keyboard Status Read Register is set to '1', signifying a command, and the IBF in the same register is set to '1'. When the Runtime\n     Register at offset 4h is read by the Host, it functions as the Keyboard Status Read Register. -------- */

typedef union
{
  uint8_t  w;
} __KBC_HOST_EC_CMD_bits_t;
#define KBC_HOST_EC_CMD_RESETVALUE          (0x00U)                                       /**<  (KBC_HOST_EC_CMD) WRITE_CMD. This 8-bit register is write-only and is an alias of the register at offset 0h. When written, the C/D bit in the\n     Keyboard Status Read Register is set to '1', signifying a command, and the IBF in the same register is set to '1'. When the Runtime\n     Register at offset 4h is read by the Host, it functions as the Keyboard Status Read Register.  Reset Value */

#define KBC_HOST_EC_CMD_Msk                   (0x00000000UL)                                 /**< (KBC_HOST_EC_CMD) Register Mask  */

/* -------- KBC_KBD_STATUS : (KBC Offset: 0x04) (R/ 8) Keyboard Status Read Register. This register is a read-only alias of the EC Keyboard Status Register. -------- */

typedef union
{
  struct
  {
    uint8_t  OBF:1;                     /**< bit:      0  Output Buffer Full.                           */
    uint8_t  IBF:1;                     /**< bit:      1  Input Buffer Full.                            */
    uint8_t  UD0:1;                     /**< bit:      2  User-defined data.                            */
    uint8_t  CMD_DATA:1;                /**< bit:      3  Command Data. This bit specifies whether the input data register contains data or a command ('0' = data, '1' = command). */
    uint8_t  UD1:1;                     /**< bit:      4  User-defined data.                            */
    uint8_t  AUXOBF:1;                  /**< bit:      5  Auxiliary Output Buffer Full.                 */
    uint8_t  UD2:2;                     /**< bit:   6..7  User-defined data.                            */
  };
  uint8_t  w;
} __KBC_KBD_STATUS_bits_t;
#define KBC_KBD_STATUS_RESETVALUE           (0x00U)                                       /**<  (KBC_KBD_STATUS) Keyboard Status Read Register. This register is a read-only alias of the EC Keyboard Status Register.  Reset Value */

#define KBC_KBD_STATUS_OBF_Pos                (0)                                            /**< (KBC_KBD_STATUS) Output Buffer Full. Position */
#define KBC_KBD_STATUS_OBF_Msk                (0x1U << KBC_KBD_STATUS_OBF_Pos)               /**< (KBC_KBD_STATUS) Output Buffer Full. Mask */
#define KBC_KBD_STATUS_IBF_Pos                (1)                                            /**< (KBC_KBD_STATUS) Input Buffer Full. Position */
#define KBC_KBD_STATUS_IBF_Msk                (0x1U << KBC_KBD_STATUS_IBF_Pos)               /**< (KBC_KBD_STATUS) Input Buffer Full. Mask */
#define KBC_KBD_STATUS_UD0_Pos                (2)                                            /**< (KBC_KBD_STATUS) User-defined data. Position */
#define KBC_KBD_STATUS_UD0_Msk                (0x1U << KBC_KBD_STATUS_UD0_Pos)               /**< (KBC_KBD_STATUS) User-defined data. Mask */
#define KBC_KBD_STATUS_CMD_DATA_Pos           (3)                                            /**< (KBC_KBD_STATUS) Command Data. This bit specifies whether the input data register contains data or a command ('0' = data, '1' = command). Position */
#define KBC_KBD_STATUS_CMD_DATA_Msk           (0x1U << KBC_KBD_STATUS_CMD_DATA_Pos)          /**< (KBC_KBD_STATUS) Command Data. This bit specifies whether the input data register contains data or a command ('0' = data, '1' = command). Mask */
#define KBC_KBD_STATUS_UD1_Pos                (4)                                            /**< (KBC_KBD_STATUS) User-defined data. Position */
#define KBC_KBD_STATUS_UD1_Msk                (0x1U << KBC_KBD_STATUS_UD1_Pos)               /**< (KBC_KBD_STATUS) User-defined data. Mask */
#define KBC_KBD_STATUS_AUXOBF_Pos             (5)                                            /**< (KBC_KBD_STATUS) Auxiliary Output Buffer Full. Position */
#define KBC_KBD_STATUS_AUXOBF_Msk             (0x1U << KBC_KBD_STATUS_AUXOBF_Pos)            /**< (KBC_KBD_STATUS) Auxiliary Output Buffer Full. Mask */
#define KBC_KBD_STATUS_UD2_Pos                (6)                                            /**< (KBC_KBD_STATUS) User-defined data. Position */
#define KBC_KBD_STATUS_UD2_Msk                (0x3U << KBC_KBD_STATUS_UD2_Pos)               /**< (KBC_KBD_STATUS) User-defined data. Mask */
#define KBC_KBD_STATUS_UD2(value)             (KBC_KBD_STATUS_UD2_Msk & ((value) << KBC_KBD_STATUS_UD2_Pos))
#define KBC_KBD_STATUS_Msk                    (0x000000FFUL)                                 /**< (KBC_KBD_STATUS) Register Mask  */

/* -------- KBC_HOST2EC_DATA : (KBC Offset: 0x100) (R/ 8) Host_EC Data/Cmd Register  This register is an alias of the HOST_EC Data / CMD Register. When read at the EC-Only offset\n     of 0h, it returns the data written by the Host to either Runtime Register offset 0h or Runtime Register offset 04h. -------- */

typedef union
{
  uint8_t  w;
} __KBC_HOST2EC_DATA_bits_t;
#define KBC_HOST2EC_DATA_RESETVALUE         (0x00U)                                       /**<  (KBC_HOST2EC_DATA) Host_EC Data/Cmd Register  This register is an alias of the HOST_EC Data / CMD Register. When read at the EC-Only offset\n     of 0h, it returns the data written by the Host to either Runtime Register offset 0h or Runtime Register offset 04h.  Reset Value */

#define KBC_HOST2EC_DATA_Msk                  (0x00000000UL)                                 /**< (KBC_HOST2EC_DATA) Register Mask  */

