ranjithaguna/pv/LED_Demo/source/pic32cx/component/kbc.h
/** \brief KBC register API structure */
typedef struct
{  /* The keyboard controller uses the EC to produce a superset of the features provided by the\n        industry-standard 8042 keyboard controller. The 8042 Emulated Keyboard Controller is a Host/EC\n     Message Interface with hardware assists to emulate 8042 behavior and provide Legacy GATEA20 support. */
  __I   __KBC_EC_HOST_DATA_AUX_DATA_bits_t EC_HOST_DATA_AUX_DATA; /**< Offset: 0x00 (R/    8) READ_DATA. This 8-bit register is read-only. When read by the Host, the PCOBF and/or AUXOBF interrupts are cleared and the\n     OBF flag in the status register is cleared. */
  __O   __KBC_HOST_EC_DATA_bits_t      HOST_EC_DATA;  /**< Offset: 0x00 ( /W   8) WRITE_DATA. This 8-bit register is write-only. When written, the C/D bit in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host,\n     it functions as the EC_HOST Data / AUX Data Register. */
  __O   __KBC_HOST_EC_CMD_bits_t       HOST_EC_CMD;   /**< Offset: 0x04 ( /W   8) WRITE_CMD. This 8-bit register is write-only and is an alias of the register at offset 0h. When written, the C/D bit in the\n     Keyboard Status Read Register is set to '1', signifying a command, and the IBF in the same register is set to '1'. When the Runtime\n     Register at offset 4h is read by the Host, it functions as the Keyboard Status Read Register. */
  __I   __KBC_KBD_STATUS_bits_t        KBD_STATUS;    /**< Offset: 0x04 (R/    8) Keyboard Status Read Register. This register is a read-only alias of the EC Keyboard Status Register. */
  __I   __KBC_HOST2EC_DATA_bits_t      HOST2EC_DATA;  /**< Offset: 0x100 (R/    8) Host_EC Data/Cmd Register  This register is an alias of the HOST_EC Data / CMD Register. When read at the EC-Only offset\n     of 0h, it returns the data written by the Host to either Runtime Register offset 0h or Runtime Register offset 04h. */
  __O   __KBC_EC_DATA_bits_t           EC_DATA;       /**< Offset: 0x100 ( /W   8) EC_Host Data Register */
  __IO  __KBC_EC_KBD_STATUS_bits_t     EC_KBD_STATUS; /**< Offset: 0x104 (R/W   8) Keyboard Status Register */
  __IO  __KBC_CONTROL_bits_t           CONTROL;       /**< Offset: 0x108 (R/W   8) Keyboard Control Register */
  __O   __KBC_EC_AUX_DATA_bits_t       EC_AUX_DATA;   /**< Offset: 0x10C ( /W   8) EC_Host Aux Register. This 8-bit register is write-only. When written, the C/D in the Keyboard Status Read Register is cleared\n     to '0', signifying data, and the IBF in the same register is set to '1'. When the Runtime Register at offset 0h is read by the Host, it\n     functions as the EC_HOST Data / AUX Data Register. */
  __IO  __KBC_PCOBF_bits_t             PCOBF;         /**< Offset: 0x114 (R/W   8) 8042 Emulated Keyboard Controller PCOBF Register */
  __IO  __KBC_ACTIVATE_bits_t          ACTIVATE;      /**< Offset: 0x330 (R/W   8) Activate Register */
} kbc_registers_t;
/** @}  end of The keyboard controller uses the EC to produce a superset of the features provided by the\n        industry-standard 8042 keyboard controller. The 8042 Emulated Keyboard Controller is a Host/EC\n     Message Interface with hardware assists to emulate 8042 behavior and provide Legacy GATEA20 support. */

#endif /* _PIC32CX_0525SG12_KBC_COMPONENT_H_ */
